In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([1,2,3,4,5])

In [5]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
obj.array

<PandasArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj[3]

4

In [12]:
obj2["a"]

-5

In [13]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    4
dtype: int64

In [14]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [16]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [17]:
np.power(obj2,2)

d    16
b    49
a    25
c     9
dtype: int64

In [18]:
"b" in obj2

True

In [19]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [20]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [21]:
obj3=pd.Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
obj.to_dict()

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5}

In [24]:
obj2.to_dict()

{'d': 4, 'b': 7, 'a': -5, 'c': 3}

In [25]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [26]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [27]:
obj4 = pd.Series(sdata, index=states)

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [31]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [32]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [36]:
obj4.name="population"

In [37]:
obj4.index.name="state"

In [38]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [39]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [40]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan","John"]

In [41]:
obj

Bob      1
Steve    2
Jeff     3
Ryan     4
John     5
dtype: int64

In [42]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [43]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [44]:
frame = pd.DataFrame(data)

In [45]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [46]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [47]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [48]:
frame.head(10)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [49]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [50]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [51]:
pd.DataFrame(data,columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [52]:
pd.DataFrame(frame,columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [53]:
frame2 = pd.DataFrame(data,columns=["year","state","pop","debt"])

In [54]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [55]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [56]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [57]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [58]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [59]:
frame2.loc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [60]:
frame2.iloc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [61]:
frame2["debt"] = 16.5

In [62]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [63]:
frame2["debt"] = np.arange(6.)

In [64]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [65]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [66]:
frame2["debt"] = val

In [67]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [68]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [69]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [70]:
#del frame2.eastern #this approach wont work

In [71]:
del frame2["eastern"]

In [72]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [73]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [74]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},"Nevada": {2001: 2.4, 2002: 2.9}}

In [76]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [77]:
frame3 = pd.DataFrame(populations)

In [78]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [79]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [80]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [81]:
frame3["Ohio"]

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [82]:
frame3["Ohio"][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [83]:
frame3["Nevada"][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [84]:
pdata = {"Ohio": frame3["Ohio"][:-1],"Nevada": frame3["Nevada"][:2]}

In [85]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64,
 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [86]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [87]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [88]:
frame3.index.name="year"

In [89]:
frame3.columns.name="state"

In [90]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [93]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [94]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [95]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [96]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [97]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [98]:
obj

a    0
b    1
c    2
dtype: int64

In [99]:
index = obj.index

In [100]:
index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
index[1:]

Index(['b', 'c'], dtype='object')

In [103]:
#index[1] = "d"  # TypeError  immutable

In [104]:
labels = pd.Index(np.arange(3))

In [105]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [109]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [110]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [111]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [112]:
obj2.index is labels

True

In [114]:
labels2 = pd.Index(np.arange(3))

In [115]:
obj2.index is labels2

False

In [118]:
obj3 = pd.Series([1.5, -2.5, 8], index=np.arange(3))  # we can give pd.Index object, np.arrrange(), 
#list of elements etc

In [119]:
obj3

0    1.5
1   -2.5
2    8.0
dtype: float64

In [120]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [121]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [123]:
'Ohio' in frame3.columns

True

In [124]:
2003 in frame3.index

False

In [125]:
2002 in frame3.index

True

In [127]:
index3=pd.Index(["foo", "foo", "bar", "bar"])

In [128]:
index3

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [130]:
# index3.append("foobar")  # TypeError("all inputs must be Index")

In [131]:
index4=pd.Index(["foobar", "barfoo"])

In [132]:
index3.append(index4)

Index(['foo', 'foo', 'bar', 'bar', 'foobar', 'barfoo'], dtype='object')

In [133]:
index4.append(index3)

Index(['foobar', 'barfoo', 'foo', 'foo', 'bar', 'bar'], dtype='object')

In [135]:
index44=index4.append(index4)

In [136]:
index44

Index(['foobar', 'barfoo', 'foobar', 'barfoo'], dtype='object')

In [138]:
index44.delete(0)

Index(['barfoo', 'foobar', 'barfoo'], dtype='object')

In [139]:
index44.insert(0, 'Suburban')

Index(['Suburban', 'foobar', 'barfoo', 'foobar', 'barfoo'], dtype='object')

In [140]:
index44.is_monotonic

/var/folders/js/z2yjw_7n13q33ktjf_r8zcnm0000gn/T/ipykernel_84180/3556110637.py:1: FutureWarning: is_monotonic is deprecated and will be removed in a future version. Use is_monotonic_increasing instead.
  index44.is_monotonic

False

In [141]:
index44.is_unique

False

In [142]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [143]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [144]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [145]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [146]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                         index=["a", "c", "d"],
                         columns=["Ohio", "Texas", "California"])

In [147]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [148]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [150]:
states = ["Texas", "Utah", "California"]

In [151]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [152]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [153]:
frame.reindex(states, axis='columns')

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [154]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [155]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [157]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [158]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [159]:
new_obj = obj.drop("c")

In [160]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [161]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [162]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [166]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=["Ohio", "Colorado", "Utah", "New York"],
                 columns=["one", "two", "three", "four"])

In [167]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data.drop(index=["Ohio", "Colorado"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [169]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [170]:
data.drop("two",axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [172]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [173]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [174]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [175]:
obj["b"]

1.0

In [176]:
obj[1]

1.0

In [177]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [178]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [179]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [180]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [181]:
 obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [182]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [183]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [184]:
obj1

2    1
0    2
1    3
dtype: int64

In [185]:
obj2

a    1
b    2
c    3
dtype: int64

In [186]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [189]:
obj2[[0, 1,2]]

a    1
b    2
c    3
dtype: int64

In [191]:
#obj2.loc[[0, 1]]  #KeyError: "None of [Int64Index([0, 1], dtype='int64')] are in the [index]"

In [192]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [193]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [194]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [195]:
obj2.loc["b":"c"] = 5

In [196]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                       index=["Ohio", "Colorado", "Utah", "New York"],
                      columns=["one", "two", "three", "four"])

In [197]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [198]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [199]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [200]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [201]:
data[data < 5] = 0

In [202]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [203]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [205]:
data.loc[:,"two"]

Ohio         0
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [206]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [207]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [208]:
data.loc["Utah"]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [210]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [213]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [214]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [215]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [216]:
data.iloc[[2], [3, 0, 1]]

      four  one  two
Utah    11    8    9

In [217]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [218]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [219]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [220]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [221]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [226]:
ser = pd.Series(np.arange(3.))

In [227]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [228]:
data.loc[:, "one"] = 1

In [229]:
data.iloc[2] = 5

In [230]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [231]:
data.loc[data["four"] > 5] = 3

In [232]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [233]:
data.loc[data.three == 5, "three"] = 6

In [234]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [235]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [236]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [237]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [238]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [239]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [240]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                       index=["Ohio", "Texas", "Colorado"])

In [241]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                       index=["Utah", "Ohio", "Texas", "Oregon"])

In [242]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [243]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [244]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [245]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                       index=["Ohio", "Texas", "Colorado"])

In [246]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                       index=["Utah", "Ohio", "Texas", "Oregon"])

In [247]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [248]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [249]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [250]:
df1 = pd.DataFrame({"A": [1, 2]})

In [251]:
df2 = pd.DataFrame({"B": [3, 4]})

In [252]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                       columns=list("abcd"))

In [253]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                       columns=list("abcde"))

In [254]:
df2.loc[1, "b"] = np.nan

In [255]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [256]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [257]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [258]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [259]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [260]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                         columns=list("bde"),
                         index=["Utah", "Ohio", "Texas", "Oregon"])

In [261]:
series = frame.iloc[0]

In [262]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [263]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [264]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [265]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [266]:
series2

b    0
e    1
f    2
dtype: int64

In [267]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [268]:
series3 = frame["d"]

In [269]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [270]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [271]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [272]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [273]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                        columns=list("bde"),
                         index=["Utah", "Ohio", "Texas", "Oregon"])

In [274]:
frame

               b         d         e
Utah   -1.080546 -0.091079  0.120432
Ohio    0.691231 -0.239747  0.421892
Texas   0.311732 -0.296207  0.346636
Oregon -1.154120  0.156462 -1.812921

In [275]:
np.abs(frame)

               b         d         e
Utah    1.080546  0.091079  0.120432
Ohio    0.691231  0.239747  0.421892
Texas   0.311732  0.296207  0.346636
Oregon  1.154120  0.156462  1.812921

In [276]:
def f1(x):
        return x.max() - x.min()

In [277]:
frame.apply(f1)

b    1.845351
d    0.452668
e    2.234813
dtype: float64

In [278]:
frame

               b         d         e
Utah   -1.080546 -0.091079  0.120432
Ohio    0.691231 -0.239747  0.421892
Texas   0.311732 -0.296207  0.346636
Oregon -1.154120  0.156462 -1.812921

In [279]:
def f2(x):
        return pd.Series([x.min(), x.max()], index=["min", "max"])

In [280]:
frame.apply(f2)

            b         d         e
min -1.154120 -0.296207 -1.812921
max  0.691231  0.156462  0.421892

In [281]:
def my_format(x):
        return f"{x:.2f}"

In [282]:
frame.applymap(my_format)

            b      d      e
Utah    -1.08  -0.09   0.12
Ohio     0.69  -0.24   0.42
Texas    0.31  -0.30   0.35
Oregon  -1.15   0.16  -1.81

In [283]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [284]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [285]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [286]:
obj = pd.Series([4, 7, -3, 2])

In [287]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [288]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [289]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [290]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [291]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [292]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [293]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [294]:
frame.sort_index()

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [295]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [297]:
frame.sort_values("b",ascending=False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [298]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [299]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [300]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [301]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [302]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                         "c": [-2, 5, 8, -2.5]})

In [303]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [304]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [305]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                      index=["a", "a", "b", "b", "c"])

In [306]:
df

          0         1         2
a  0.457100  0.816515 -0.318451
a -0.517964 -0.422244  0.301080
b  1.560038 -1.628772  1.308734
b -0.519031  0.102674 -1.083750
c -0.254598  1.018136 -0.438361

In [307]:
df.loc["b"]

          0         1         2
b  1.560038 -1.628772  1.308734
b -0.519031  0.102674 -1.083750

In [308]:
df.loc["c"]

0   -0.254598
1    1.018136
2   -0.438361
Name: c, dtype: float64

In [309]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                      [np.nan, np.nan], [0.75, -1.3]],
                      index=["a", "b", "c", "d"],
                      columns=["one", "two"])

In [310]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [311]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [312]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [313]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [314]:
df.sum(axis="index", skipna=True)

one    9.25
two   -5.80
dtype: float64

In [315]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [318]:
df.sum(axis="columns", skipna=True)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [319]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [320]:
df.idxmax()

one    b
two    d
dtype: object

In [321]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [322]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [323]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [324]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [ ]:
#pydata-book-3rd-edition/examples/

In [326]:
price = pd.read_pickle("pydata-book-3rd-edition/examples/yahoo_price.pkl")

In [327]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [336]:
returns = price.pct_change()

In [337]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [338]:
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [339]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [340]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [341]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [342]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [344]:
volume = pd.read_pickle("pydata-book-3rd-edition/examples/yahoo_volume.pkl")

In [345]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [346]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [350]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [349]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [351]:
uniques.sort()

In [352]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [354]:
pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [355]:
mask = obj.isin(["b", "c"])

In [356]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [358]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [359]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [360]:
unique_vals = pd.Series(["c", "b", "a"])

In [361]:
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2])

In [362]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                         "Qu2": [2, 3, 1, 2, 3],
                         "Qu3": [1, 5, 2, 4, 4]})

In [363]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [364]:
data["Qu1"].value_counts()

3    2
4    2
1    1
Name: Qu1, dtype: int64

In [365]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [367]:
result = data.apply(pd.value_counts)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [368]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [371]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [372]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
dtype: int64